# İleri Birleştirme İşlemleri

In [2]:
import pandas as pd

In [3]:
#Birebir Birleştirme

In [4]:
df1 = pd.DataFrame({'Çalışanlar': ["Ali", "Veli", "Ayşe", "Fatma"],
                   'Grup': ["Muhasebe", "Mühendislik", "Mühendislik", "Ik"]})
df1

  Çalışanlar         Grup
0        Ali     Muhasebe
1       Veli  Mühendislik
2       Ayşe  Mühendislik
3      Fatma           Ik

In [5]:
df2 = pd.DataFrame({'Çalışanlar': ["Ayşe", "Ali", "Veli", "Fatma"],
                   'İlk Giriş': [2010, 2009, 2014, 2019]})
df2

  Çalışanlar  İlk Giriş
0       Ayşe       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [6]:
pd.merge(df1, df2)

  Çalışanlar         Grup  İlk Giriş
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayşe  Mühendislik       2010
3      Fatma           Ik       2019

In [7]:
# on argümanı ile neye göre birleştirileceği belirrtilebilir belirtilmezse otomatik yapar
pd.merge(df1, df2, on="Çalışanlar")

  Çalışanlar         Grup  İlk Giriş
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayşe  Mühendislik       2010
3      Fatma           Ik       2019

In [8]:
# Many to one (Çoktan teke)

In [9]:
df3 = pd.merge(df1, df2)
df3

  Çalışanlar         Grup  İlk Giriş
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayşe  Mühendislik       2010
3      Fatma           Ik       2019

In [10]:
df4 = pd.DataFrame({'Grup': ["Muhasebe", "Mühendislik", "Ik"],
                   'Müdür': ["Caner", "Mustafa", "Berkcan"]})
df4

          Grup    Müdür
0     Muhasebe    Caner
1  Mühendislik  Mustafa
2           Ik  Berkcan

In [11]:
pd.merge(df3, df4)

  Çalışanlar         Grup  İlk Giriş    Müdür
0        Ali     Muhasebe       2009    Caner
1       Veli  Mühendislik       2014  Mustafa
2       Ayşe  Mühendislik       2010  Mustafa
3      Fatma           Ik       2019  Berkcan

In [12]:
# Many to many (Çoktan çoka)

In [13]:
df5 = pd.DataFrame({'Grup': ["Muhasebe", "Muhasebe", "Mühendislik", "Mühendislik", "IK", "Ik"],
                   'Yetenekler': ["Matematik", "Exel", "Kodlama", "Linux", "Exel", "Yönetim"]})
df5

          Grup Yetenekler
0     Muhasebe  Matematik
1     Muhasebe       Exel
2  Mühendislik    Kodlama
3  Mühendislik      Linux
4           IK       Exel
5           Ik    Yönetim

In [14]:
df1

  Çalışanlar         Grup
0        Ali     Muhasebe
1       Veli  Mühendislik
2       Ayşe  Mühendislik
3      Fatma           Ik

In [15]:
df6 = pd.merge(df1, df5)
df6

  Çalışanlar         Grup Yetenekler
0        Ali     Muhasebe  Matematik
1        Ali     Muhasebe       Exel
2       Veli  Mühendislik    Kodlama
3       Veli  Mühendislik      Linux
4       Ayşe  Mühendislik    Kodlama
5       Ayşe  Mühendislik      Linux
6      Fatma           Ik    Yönetim

In [16]:
# Bu şekilde de bir şey yapılabilir
result = df6.groupby(["Çalışanlar", "Grup"], as_index=False).agg({
    "Yetenekler": ", ".join
})

print(result)

  Çalışanlar         Grup       Yetenekler
0        Ali     Muhasebe  Matematik, Exel
1       Ayşe  Mühendislik   Kodlama, Linux
2      Fatma           Ik          Yönetim
3       Veli  Mühendislik   Kodlama, Linux